tap "armmbed/formulae.git"
tap "cloudflare/cloudflare"
tap "homebrew/bundle"
# GNU compiler collection for arm-none-eabi
brew "arm-none-eabi-gcc"
# Cross-platform C++ Library for asynchronous programming
brew "asio"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Next generation open source RPC library and framework
brew "grpc"
# Generate compilation database for clang tooling
brew "bear"
# Compile and execute C "scripts" in one go
brew "c"
# Software library to render fonts
brew "freetype"
# C++ template library for linear algebra
brew "eigen"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Improved tinyxml (in memory efficiency and size)
brew "tinyxml2"
# Static analysis of C and C++ code
brew "cppcheck"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern replacement for 'ls'
brew "exa"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library of C++ classes for flexible logging
brew "log4cxx"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Cross-platform application and UI framework
brew "qt"
# Python bindings for v6 of Qt
brew "pyqt"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Open source computer vision library
brew "opencv"
# Core utilities for Python packages
brew "python-packaging"
# Your Gateway to Embedded Software Development Excellence
brew "platformio"
# C++ class libraries for building network and internet-based applications
brew "poco"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# XML parser
brew "tinyxml"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Open-source code editor
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "afzalsayed96.reacticons"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "anseki.vscode-color"
vscode "batisteo.vscode-django"
vscode "bbenoist.Nix"
vscode "bierner.color-info"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "Dhanush.pygame-snips"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "DotJoshJohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eg2.vscode-npm-script"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.vscode-mysql"
vscode "fougas.msys2"
vscode "foxundermoon.shell-format"
vscode "franneck94.c-cpp-runner"
vscode "georgewfraser.vscode-javac"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.vscode-pull-request-github"
vscode "GitLab.gitlab-workflow"
vscode "glenn2223.live-sass"
vscode "GoBystrokReactJS.gobystrok"
vscode "googlecloudtools.cloudcode"
vscode "Gruntfuggly.todo-tree"
vscode "hars.CppSnippets"
vscode "humao.rest-client"
vscode "Hyeon.c-math-viewer"
vscode "icrawl.discord-vscode"
vscode "jakob101.RelativePath"
vscode "James-Yu.latex-workshop"
vscode "jaycetyle.vscode-gnu-global"
vscode "jbenden.c-cpp-flylint"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.pwa-tools"
vscode "johnpapa.vscode-peacock"
vscode "kamikillerto.vscode-colorize"
vscode "KevinRose.vsc-python-indent"
vscode "kiranshah.chatgpt-helper"
vscode "lamartire.git-indicators"
vscode "Lambdatest.LambdaTest-Cloud"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mathematic.vscode-latex"
vscode "mikestead.dotenv"
vscode "mkhl.direnv"
vscode "mquandalle.graphql"
vscode "mrmlnc.vscode-autoprefixer"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.notepadplusplus-keybindings"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mwpb.java-prettier-formatter"
vscode "negokaz.live-server-preview"
vscode "njpwerner.autodocstring"
vscode "nluka-jallard.ctructure"
vscode "platformio.platformio-ide"
vscode "pnp.polacode"
vscode "PowerTech.powercpp"
vscode "pranaygp.vscode-css-peek"
vscode "psycha0s.cpp-format"
vscode "PWABuilder.pwa-studio"
vscode "Ransh.ransh"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "ronaldosena.arduino-snippets"
vscode "Rubymaniac.vscode-direnv"
vscode "runningcoder.js-snippets"
vscode "Shan.code-settings-sync"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SonarSource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "TabNine.tabnine-vscode"
vscode "teabyii.ayu"
vscode "techer.open-in-browser"
vscode "tomoki1207.pdf"
vscode "tushortz.pygame-snippets"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vlanguage.vscode-vlang"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "voldemortensen.rainbow-tags"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "WallabyJs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "xabikos.JavaScriptSnippets"
vscode "xaver.clang-format"
vscode "xoanis.clion-formatter"
vscode "yandeu.five-server"
vscode "yatki.vscode-surround"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "Zignd.html-css-class-completion"
vscode "znck.grammarly"
vscode "ZolarDev.js-runner"
